QUIZ_QUESTIONS = [
    {
        "question": "1. Какая стратегия продуктивности тебе ближе?",
        "options": {
            "Работать в команде": "mammals",
            "Быстро переключаться": "birds",
            "Долго концентрироваться": "reptiles",
            "Легко подстраиваться": "amphibians"
        }
    },
    {
        "question": "2. Твоя идеальная температура для жизни?",
        "options": {
            "Уют и теплый плед": "mammals",
            "Свежий ветер и простор": "birds",
            "Жара и солнце": "reptiles",
            "Прохлада и влажность": "amphibians"
        }
    },
    {
        "question": "3. Как ты относишься к личным границам?",
        "options": {
            "Люблю обнимашки": "mammals",
            "Соблюдаю дистанцию": "birds",
            "Мой дом — моя крепость": "reptiles",
            "Мне везде комфортно": "amphibians"
        }
    },
    {
        "question": "4. Твой стиль в еде?",
        "options": {
            "Сытные блюда и десерты": "mammals",
            "Легкие перекусы на бегу": "birds",
            "Редко, но основательно": "reptiles",
            "Морепродукты или сочное": "amphibians"
        }
    },
    {
        "question": "5. В чем твоя главная суперсила?",
        "options": {
            "Эмпатия и чувства": "mammals",
            "Скорость и кругозор": "birds",
            "Железное спокойствие": "reptiles",
            "Умение выйти сухим из воды": "amphibians"
        }
    },
    {
        "question": "6. Твой идеальный отпуск?",
        "options": {
            "С семьей или друзьями": "mammals",
            "Полет в новое место": "birds",
            "Уединение в тишине": "reptiles",
            "Отдых у воды": "amphibians"
        }
    },
    {
        "question": "7. Как ты принимаешь решения?",
        "options": {
            "Слушаю сердце": "mammals",
            "Быстро и интуитивно": "birds",
            "Холодно и расчетливо": "reptiles",
            "Жду момента": "amphibians"
        }
    },
    {
        "question": "8. Какое качество в людях ты ценишь больше всего?",
        "options": {
            "Верность и доброту": "mammals",
            "Креативность": "birds",
            "Честность": "reptiles",
            "Гибкость ума": "amphibians"
        }
    }
]